app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (business_id = 1)
---
  def index
    # List all of the Items that are owned by the logged in User's Business
    if current_business.present?
       @items = Item.where("business_id = ?", current_business.id)